spec/pay_pro/endpoints/refunds_spec.rb

# frozen_string_literal: true

RSpec.describe PayPro::Endpoints::Refunds do
  describe '#list' do
    subject(:list) { endpoint.list }

    let(:endpoint) { described_class.new(api_client: default_api_client) }

    let(:url) { 'https://api.paypro.nl/refunds' }

    before do
      stub_request(:get, url).and_return(
        body: File.read('spec/fixtures/refunds/list.json')
      )
    end

    it 'does the correct request' do
      list
      expect(a_request(:get, url)).to have_been_made
    end

    it 'returns a List' do
      list
      expect(list).to be_a(PayPro::List)
    end

    it 'has refunds' do
      list
      expect(list.data[0]).to be_a(PayPro::Refund)
    end

    context 'with options' do
      subject(:list) { endpoint.list(api_url: 'https://api-test.paypro.nl') }

      let(:url) { 'https://api-test.paypro.nl/refunds' }

      it 'does the correct request' do
        list
        expect(a_request(:get, url)).to have_been_made
      end
    end
  end

  describe '#get' do
    subject(:get) { endpoint.get(id) }

    let(:endpoint) { described_class.new(api_client: default_api_client) }

    let(:id) { 'PRNAUYTZ727UED' }
    let(:url) { "https://api.paypro.nl/refunds/#{id}" }

    before do
      stub_request(:get, url).and_return(
        body: File.read('spec/fixtures/refunds/get.json')
      )
    end

    it 'does the correct request' do
      get
      expect(a_request(:get, url)).to have_been_made
    end

    it 'returns a Refund' do
      expect(get).to be_a(PayPro::Refund)
    end

    it 'has the correct attributes' do
      expect(get).to have_attributes(
        id: id,
        description: 'Test Payment',
        refunded_at: nil
      )
    end

    context 'with options' do
      subject(:get) { endpoint.get(id, api_url: 'https://api-test.paypro.nl') }

      let(:url) { "https://api-test.paypro.nl/refunds/#{id}" }

      it 'does the correct request' do
        get
        expect(a_request(:get, url)).to have_been_made
      end
    end
  end
end
